# IRevisionsOnSheetUIServer Interface

---
C#Visual BasicVisual C++
Revit 2024 API
---
IRevisionsOnSheetUIServer Interface
Members See Also
---
The interface used to provide UI for sheet's Revisions On Sheet property.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public interface IRevisionsOnSheetUIServer : IExternalServer
```

Visual Basic
---
```text
Public Interface IRevisionsOnSheetUIServer _
	Inherits IExternalServer
```

Visual C++
---
```text
public interface class IRevisionsOnSheetUIServer : IExternalServer
```

# See Also
IRevisionsOnSheetUIServer Members
Autodesk.Revit.UI Namespace